pouliquen22/0/href_nlgf.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      href_nlgf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];
#include "../parameters";

internalField   $y9;


boundaryField
{
    left
    {
        type fixedValue;
        value $internalField;
    }
    ramp
    {
     	type fixedValue;
        value $internalField;
    }
    top
    {
     	type fixedValue;
        value $internalField;
    }
    right
    {
     	type fixedValue;
        value $internalField;
    }
    bottom
    {
     	type fixedValue;
        value $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}
  

// ************************************************************************* //
