pouliquen22/0/nut.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 2 -1 0 0 0 0];

internalField       uniform 0;

boundaryField
{
  left
    {
        type               nutkWallFunction;
        value              $internalField;
    }
  ramp
    {
        type               nutkWallFunction;
        value              $internalField;
    }
  top
    {
        type               calculated;
        value              $internalField;
    }
  right
    {
        type               calculated;
        value              $internalField;
    }
  bottom
   {
        type               calculated;
        value              $internalField;
   }
  defaultFaces
    {
          type             empty;
    }

}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
